package llm

import "testing"

func TestTTSMaker_Audio(t *testing.T) {
	g := _genshinvoice{}
	audio, err := g.Audio("流萤_ZH", "喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」喵～「我梦见一片焦土，一株破土而生的新蕊，它迎着朝阳绽放，向我低语，呢喃。」")
	if err != nil {
		t.Fatal(err)
	}

	t.Log(audio)
}
